matsimon/freebsd-src/share/man/man4/ice.4
.\" Copyright (c) 2019 - 2020, Intel Corporation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms of the Software, with or
.\" without modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright notice,
.\"    this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright notice,
.\"    this list of conditions and the following disclaimer in the documentation
.\"    and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Intel Corporation nor the names of its
.\"    contributors may be used to endorse or promote products derived from
.\"    this Software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
.\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" * Other names and brands may be claimed as the property of others.
.\"
.\" $FreeBSD: src/share/man/man4/ice.4
.\"
.Dd July 20, 2020
.Dt ice 4
.Os
.Dd July 20, 2020
.Dt ICE 4
.Os
.Sh NAME
.Nm ice
.Nd "Intel(R) Ethernet Driver for the FreeBSD* operating system"
.Sh SYNOPSIS
.Cd "device ice"
.Sh DESCRIPTION
The
.Nm
driver provides support for any PCI Express adapter or LOM
(LAN On Motherboard)
in the Intel Ethernet 800 Series.
As of this writing, the series includes devices with these model numbers:
.Pp
.Bl -bullet -compact
.It
E810-C (100G)
.It
E810-XXV (25G)
.El
.Pp
For questions related to hardware requirements, refer to the documentation
supplied with your adapter.
.Pp
Support for Jumbo Frames is provided via the interface MTU setting.
Selecting an MTU larger than 1500 bytes with the
.Xr ifconfig 8
utility configures the adapter to receive and transmit Jumbo Frames.
The maximum MTU setting for Jumbo Frames is 9706. This value coincides
with the maximum Jumbo Frames size of 9728.
This driver version supports VLANs.
For information on enabling VLANs, see the
.Pa README .
.Pp
Offloads are also controlled via the interface, for instance, checksumming for
both IPv4 and IPv6 can be set and unset, TSO4 and/or TSO6, and finally LRO can
be set and unset.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
See the
.Xr iflib 4 .
man page for more information on using iflib sysctl variables as tunables.
.Bl -tag -width indent
.It Va hw.ice.enable_msix
Allows one to enable/disable MSIX, thus forcing MSI instead.
.It Va hw.ice.ringsz
Set the number of descriptors in the rings. Note that this
changes BOTH the TX and RX rings; they cannot be set independently.
This tunable isn't available if using iflib.
.It Va hw.ice.max_queues
Set the number of queues (each a TX/RX pair) for the port. This
allows one to override the autocalculation if it's set to 0.
This tunable isn't available if using iflib.
.It Va hw.ice.dynamic_rx_itr
The dynamic RX interrupt control. Set to 1 to enable.
.It Va hw.ice.dynamic_tx_itr
The dynamic TX interrupt control. Set to 1 to enable.
.It Va hw.ice.rx_itr
The RX interrupt rate value.
.It Va hw.ice.tx_itr
The TX interrupt rate value.
.El
.Pp
.Sh SYSCTL PROCEDURES
.Bl -tag -width indent
.It Va hw.ice.fc
Allows one to set the flow control value. A value of 0 disables flow control,
3 enables full, 1 is RX, and 2 is TX pause.
.It Va hw.ice.advertise_speed
Allows one to set advertised link speeds, this will then cause a link
renegotiation. With the appropriate adapter this can cause a link at 10GB,
1GB, or 100MB.
.It Va hw.ice.current_speed
This is a display of the current setting.
.It Va hw.ice.fw_version
This is a display of the Firmware version.
.Sh Interrupt Storms
It is important to note that 40G operation can generate
high numbers of interrupts, often incorrectly being interpreted as a storm
condition in the kernel.
It is suggested that this be resolved by setting:
.Bl -tag -width indent
.It Va hw.intr_storm_threshold: 0
.Sh DIAGNOSTICS
.Bl -diag
.It "ice%d: Unable to allocate bus resource: memory"
A fatal initialization error has occurred.
.It "ice%d: Unable to allocate bus resource: interrupt"
A fatal initialization error has occurred.
.It "ice%d: watchdog timeout -- resetting"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SUPPORT
For additional information regarding building and installation, see the
.Pa README
included with the driver.
For general information, go to the Intel support website at:
.Pa http://www.intel.com/support/

.Pp
If an issue is identified with the released source code on a supported kernel with a supported adapter, email the specific information related to the issue to freebsd@intel.com
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ng_ether 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 12.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Intel Corporation Aq freebsd@intel.com
